MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NANO120VD2AN/mcu.h
#define ADC_CR_TRGE_Pos                (8)                                               /*!< ADC_T::CR: TRGE Position                */
#define ADC_CR_TRGE_Msk                (0x1ul << ADC_CR_TRGE_Pos)                        /*!< ADC_T::CR: TRGE Mask                    */

#define ADC_CR_PTEN_Pos                (9)                                               /*!< ADC_T::CR: PTEN Position                */
#define ADC_CR_PTEN_Msk                (0x1ul << ADC_CR_PTEN_Pos)                        /*!< ADC_T::CR: PTEN Mask                    */

#define ADC_CR_ADST_Pos                (11)                                              /*!< ADC_T::CR: ADST Position                */
#define ADC_CR_ADST_Msk                (0x1ul << ADC_CR_ADST_Pos)                        /*!< ADC_T::CR: ADST Mask                    */

#define ADC_CR_TMSEL_Pos               (12)                                              /*!< ADC_T::CR: TMSEL Position               */
#define ADC_CR_TMSEL_Msk               (0x3ul << ADC_CR_TMSEL_Pos)                       /*!< ADC_T::CR: TMSEL Mask                   */

#define ADC_CR_TMTRGMOD_Pos            (15)                                              /*!< ADC_T::CR: TMTRGMOD Position            */
#define ADC_CR_TMTRGMOD_Msk            (0x1ul << ADC_CR_TMTRGMOD_Pos)                    /*!< ADC_T::CR: TMTRGMOD Mask                */

#define ADC_CR_REFSEL_Pos              (16)                                              /*!< ADC_T::CR: REFSEL Position              */
#define ADC_CR_REFSEL_Msk              (0x3ul << ADC_CR_REFSEL_Pos)                      /*!< ADC_T::CR: REFSEL Mask                  */

#define ADC_CHEN_CHEN0_Pos             (0)                                               /*!< ADC_T::CHEN: CHEN0 Position             */
#define ADC_CHEN_CHEN0_Msk             (0x1ul << ADC_CHEN_CHEN0_Pos)                     /*!< ADC_T::CHEN: CHEN0 Mask                 */

#define ADC_CHEN_CHEN1_Pos             (1)                                               /*!< ADC_T::CHEN: CHEN1 Position             */
#define ADC_CHEN_CHEN1_Msk             (0x1ul << ADC_CHEN_CHEN1_Pos)                     /*!< ADC_T::CHEN: CHEN1 Mask                 */

#define ADC_CHEN_CHEN2_Pos             (2)                                               /*!< ADC_T::CHEN: CHEN2 Position             */
#define ADC_CHEN_CHEN2_Msk             (0x1ul << ADC_CHEN_CHEN2_Pos)                     /*!< ADC_T::CHEN: CHEN2 Mask                 */

#define ADC_CHEN_CHEN3_Pos             (3)                                               /*!< ADC_T::CHEN: CHEN3 Position             */
#define ADC_CHEN_CHEN3_Msk             (0x1ul << ADC_CHEN_CHEN3_Pos)                     /*!< ADC_T::CHEN: CHEN3 Mask                 */

#define ADC_CHEN_CHEN4_Pos             (4)                                               /*!< ADC_T::CHEN: CHEN4 Position             */
#define ADC_CHEN_CHEN4_Msk             (0x1ul << ADC_CHEN_CHEN4_Pos)                     /*!< ADC_T::CHEN: CHEN4 Mask                 */

#define ADC_CHEN_CHEN5_Pos             (5)                                               /*!< ADC_T::CHEN: CHEN5 Position             */
#define ADC_CHEN_CHEN5_Msk             (0x1ul << ADC_CHEN_CHEN5_Pos)                     /*!< ADC_T::CHEN: CHEN5 Mask                 */

#define ADC_CHEN_CHEN6_Pos             (6)                                               /*!< ADC_T::CHEN: CHEN6 Position             */
#define ADC_CHEN_CHEN6_Msk             (0x1ul << ADC_CHEN_CHEN6_Pos)                   /*!< ADC_T::CHEN: CHEN6 Mask                 */

#define ADC_CHEN_CHEN7_Pos             (7)                                               /*!< ADC_T::CHEN: CHEN7 Position             */
#define ADC_CHEN_CHEN7_Msk             (0x1ul << ADC_CHEN_CHEN7_Pos)                   /*!< ADC_T::CHEN: CHEN7 Mask                 */

#define ADC_CHEN_CHEN10_Pos            (10)                                              /*!< ADC_T::CHEN: CHEN10 Position            */
#define ADC_CHEN_CHEN10_Msk            (0x1ul << ADC_CHEN_CHEN10_Pos)                  /*!< ADC_T::CHEN: CHEN10 Mask                */

#define ADC_CHEN_CH10SEL_Pos           (11)                                              /*!< ADC_T::CHEN: CH10SEL Position           */
#define ADC_CHEN_CH10SEL_Msk           (0x3ul << ADC_CHEN_CH10SEL_Pos)                 /*!< ADC_T::CHEN: CH10SEL Mask               */

#define ADC_CMPR0_CMPEN_Pos            (0)                                               /*!< ADC_T::CMPR0: CMPEN Position            */
#define ADC_CMPR0_CMPEN_Msk            (0x1ul << ADC_CMPR0_CMPEN_Pos)                  /*!< ADC_T::CMPR0: CMPEN Mask                */

#define ADC_CMPR0_CMPIE_Pos            (1)                                               /*!< ADC_T::CMPR0: CMPIE Position            */
#define ADC_CMPR0_CMPIE_Msk            (0x1ul << ADC_CMPR0_CMPIE_Pos)                  /*!< ADC_T::CMPR0: CMPIE Mask                */

#define ADC_CMPR0_CMPCOND_Pos          (2)                                               /*!< ADC_T::CMPR0: CMPCOND Position          */
#define ADC_CMPR0_CMPCOND_Msk          (0x1ul << ADC_CMPR0_CMPCOND_Pos)                /*!< ADC_T::CMPR0: CMPCOND Mask              */

#define ADC_CMPR0_CMPCH_Pos            (3)                                               /*!< ADC_T::CMPR0: CMPCH Position            */
#define ADC_CMPR0_CMPCH_Msk            (0xful << ADC_CMPR0_CMPCH_Pos)                  /*!< ADC_T::CMPR0: CMPCH Mask                */

#define ADC_CMPR0_CMPMATCNT_Pos        (8)                                               /*!< ADC_T::CMPR0: CMPMATCNT Position        */
#define ADC_CMPR0_CMPMATCNT_Msk        (0xful << ADC_CMPR0_CMPMATCNT_Pos)              /*!< ADC_T::CMPR0: CMPMATCNT Mask            */

#define ADC_CMPR0_CMPD_Pos             (16)                                              /*!< ADC_T::CMPR0: CMPD Position             */
#define ADC_CMPR0_CMPD_Msk             (0xffful << ADC_CMPR0_CMPD_Pos)                 /*!< ADC_T::CMPR0: CMPD Mask                 */

#define ADC_CMPR1_CMPEN_Pos            (0)                                               /*!< ADC_T::CMPR1: CMPEN Position            */
#define ADC_CMPR1_CMPEN_Msk            (0x1ul << ADC_CMPR1_CMPEN_Pos)                  /*!< ADC_T::CMPR1: CMPEN Mask                */

#define ADC_CMPR1_CMPIE_Pos            (1)                                               /*!< ADC_T::CMPR1: CMPIE Position            */
#define ADC_CMPR1_CMPIE_Msk            (0x1ul << ADC_CMPR1_CMPIE_Pos)                  /*!< ADC_T::CMPR1: CMPIE Mask                */

#define ADC_CMPR1_CMPCOND_Pos          (2)                                               /*!< ADC_T::CMPR1: CMPCOND Position          */
#define ADC_CMPR1_CMPCOND_Msk          (0x1ul << ADC_CMPR1_CMPCOND_Pos)                /*!< ADC_T::CMPR1: CMPCOND Mask              */

#define ADC_CMPR1_CMPCH_Pos            (3)                                               /*!< ADC_T::CMPR1: CMPCH Position            */
#define ADC_CMPR1_CMPCH_Msk            (0xful << ADC_CMPR1_CMPCH_Pos)                  /*!< ADC_T::CMPR1: CMPCH Mask                */

#define ADC_CMPR1_CMPMATCNT_Pos        (8)                                               /*!< ADC_T::CMPR1: CMPMATCNT Position        */
#define ADC_CMPR1_CMPMATCNT_Msk        (0xful << ADC_CMPR1_CMPMATCNT_Pos)              /*!< ADC_T::CMPR1: CMPMATCNT Mask            */

