MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NANO120VD2AN/mcu.h
#define FMC_ISPCON_BS_Pos                (1)                                               /*!< FMC_T::ISPCON: BS Position                */
#define FMC_ISPCON_BS_Msk                (0x1ul << FMC_ISPCON_BS_Pos)                      /*!< FMC_T::ISPCON: BS Mask                    */

#define FMC_ISPCON_APUEN_Pos             (3)                                               /*!< FMC_T::ISPCON: APUEN Position             */
#define FMC_ISPCON_APUEN_Msk             (0x1ul << FMC_ISPCON_APUEN_Pos)                   /*!< FMC_T::ISPCON: APUEN Mask                 */

#define FMC_ISPCON_CFGUEN_Pos            (4)                                               /*!< FMC_T::ISPCON: CFGUEN Position            */
#define FMC_ISPCON_CFGUEN_Msk            (0x1ul << FMC_ISPCON_CFGUEN_Pos)                  /*!< FMC_T::ISPCON: CFGUEN Mask                */

#define FMC_ISPCON_LDUEN_Pos             (5)                                               /*!< FMC_T::ISPCON: LDUEN Position             */
#define FMC_ISPCON_LDUEN_Msk             (0x1ul << FMC_ISPCON_LDUEN_Pos)                   /*!< FMC_T::ISPCON: LDUEN Mask                 */

#define FMC_ISPCON_ISPFF_Pos             (6)                                               /*!< FMC_T::ISPCON: ISPFF Position             */
#define FMC_ISPCON_ISPFF_Msk             (0x1ul << FMC_ISPCON_ISPFF_Pos)                   /*!< FMC_T::ISPCON: ISPFF Mask                 */

#define FMC_ISPCON_SWRST_Pos             (7)                                               /*!< FMC_T::ISPCON: SWRST Position             */
#define FMC_ISPCON_SWRST_Msk             (0x1ul << FMC_ISPCON_SWRST_Pos)                   /*!< FMC_T::ISPCON: SWRST Mask                 */

#define FMC_ISPCON_PT_Pos                (8)                                               /*!< FMC_T::ISPCON: PT Position                */
#define FMC_ISPCON_PT_Msk                (0x7ul << FMC_ISPCON_PT_Pos)                      /*!< FMC_T::ISPCON: PT Mask                    */

#define FMC_ISPCON_ET_Pos                (12)                                              /*!< FMC_T::ISPCON: ET Position                */
#define FMC_ISPCON_ET_Msk                (0x7ul << FMC_ISPCON_ET_Pos)                      /*!< FMC_T::ISPCON: ET Mask                    */

#define FMC_ISPADR_ISPADR_Pos            (0)                                               /*!< FMC_T::ISPADR: ISPADR Position            */
#define FMC_ISPADR_ISPADR_Msk            (0xfffffffful << FMC_ISPADR_ISPADR_Pos)           /*!< FMC_T::ISPADR: ISPADR Mask                */

#define FMC_ISPDAT_ISPDAT_Pos            (0)                                               /*!< FMC_T::ISPDAT: ISPDAT Position            */
#define FMC_ISPDAT_ISPDAT_Msk            (0xfffffffful << FMC_ISPDAT_ISPDAT_Pos)           /*!< FMC_T::ISPDAT: ISPDAT Mask                */

#define FMC_ISPCMD_FCTRL_Pos             (0)                                               /*!< FMC_T::ISPCMD: FCTRL Position             */
#define FMC_ISPCMD_FCTRL_Msk             (0xful << FMC_ISPCMD_FCTRL_Pos)                   /*!< FMC_T::ISPCMD: FCTRL Mask                 */

#define FMC_ISPCMD_FCEN_Pos              (4)                                               /*!< FMC_T::ISPCMD: FCEN Position              */
#define FMC_ISPCMD_FCEN_Msk              (0x1ul << FMC_ISPCMD_FCEN_Pos)                    /*!< FMC_T::ISPCMD: FCEN Mask                  */

#define FMC_ISPCMD_FOEN_Pos              (5)                                               /*!< FMC_T::ISPCMD: FOEN Position              */
#define FMC_ISPCMD_FOEN_Msk              (0x1ul << FMC_ISPCMD_FOEN_Pos)                    /*!< FMC_T::ISPCMD: FOEN Mask                  */

#define FMC_ISPTRG_ISPGO_Pos             (0)                                               /*!< FMC_T::ISPTRG: ISPGO Position             */
#define FMC_ISPTRG_ISPGO_Msk             (0x1ul << FMC_ISPTRG_ISPGO_Pos)                   /*!< FMC_T::ISPTRG: ISPGO Mask                 */

#define FMC_DFBADR_DFBA_Pos              (0)                                               /*!< FMC_T::DFBADR: DFBA Position              */
#define FMC_DFBADR_DFBA_Msk              (0xfffffffful << FMC_DFBADR_DFBA_Pos)             /*!< FMC_T::DFBADR: DFBA Mask                  */

#define FMC_ISPSTA_ISPBUSY_Pos           (0)                                               /*!< FMC_T::ISPSTA: ISPBUSY Position           */
#define FMC_ISPSTA_ISPBUSY_Msk           (0x1ul << FMC_ISPSTA_ISPBUSY_Pos)                 /*!< FMC_T::ISPSTA: ISPBUSY Mask               */

#define FMC_ISPSTA_CBS_Pos               (1)                                               /*!< FMC_T::ISPSTA: CBS Position               */
#define FMC_ISPSTA_CBS_Msk               (0x3ul << FMC_ISPSTA_CBS_Pos)                     /*!< FMC_T::ISPSTA: CBS Mask                   */

#define FMC_ISPSTA_ISPFF_Pos             (6)                                               /*!< FMC_T::ISPSTA: ISPFF Position             */
#define FMC_ISPSTA_ISPFF_Msk             (0x1ul << FMC_ISPSTA_ISPFF_Pos)                   /*!< FMC_T::ISPSTA: ISPFF Mask                 */

/**@}*/ /* FMC_CONST */
/**@}*/ /* end of FMC register group */


/*---------------------- System Global Control Registers -------------------------*/
/**
    @addtogroup GCR System Global Control Registers(GCR)
    Memory Mapped Structure for GCR Controller
@{ */

typedef struct
{


    /**
     * PDID
     * ===================================================================================================
     * Offset: 0x00  Part Device Identification number Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[31:0]  |PDID      |Part Device ID
     * |        |          |This register reflects device part number code.
     * |        |          |Software can read this register to identify which device is used.
    */
    __I  uint32_t PDID;

    /**
     * RST_SRC
     * ===================================================================================================
     * Offset: 0x04  System Reset Source Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |RSTS_POR  |Reset by Power-On Reset
     * |        |          |The RSTS_POR Flag Is Set By The "Reset Signal" From The Power-On Reset (POR) Module Or Bit CHIP_RST (IPRSTC1[0]) To Indicate The Previous Reset Source
     * |        |          |0= No reset from POR or CHIP_RST.
     * |        |          |1= The Power-On Reset (POR) or CHIP_RST had issued the reset signal to reset the system.
     * |        |          |This bit is cleared by writing 1 to itself.
     * |[1]     |RSTS_PAD  |Reset by /RESET Pin
     * |        |          |The RSTS_PAD Flag Is Set By The "Reset Signal" From The /RESET Pin To Indicate The Previous Reset Source
     * |        |          |0= No reset from /RESET pin.
     * |        |          |1= The /RESET pin had issued the reset signal to reset the system.
     * |        |          |This bit is cleared by writing 1 to itself.
     * |[2]     |RSTS_WDT  |Reset by Watch-Dog Timer
     * |        |          |The RSTS_WDT Flag Is Set By The "Reset Signal" From The Watch-Dog Timer Module To Indicate The Previous Reset Source
     * |        |          |0= No reset from Watch-Dog Timer.
     * |        |          |1= The Watch-Dog Timer module had issued the reset signal to reset the system.
     * |        |          |This bit is cleared by writing 1 to itself.
     * |[4]     |RSTS_BOD  |Reset by Brown-Out-Detect
     * |        |          |The RSTS_BOD Flag Is Set By The "Reset Signal" From The Brown-Out-Detected Module To Indicate The Previous Reset Source
     * |        |          |0= No reset from BOD.
     * |        |          |1= The Brown-Out-Detected module had issued the reset signal to reset the system.
     * |        |          |This bit is cleared by writing 1 to itself.
     * |[5]     |RSTS_SYS  |Reset by Cortex_M0 Kernel
     * |        |          |The RSTS_SYS Flag Is Set By The "Reset Signal" From The Cortex_M0 Kernel To Indicate The Previous Reset Source
     * |        |          |0= No reset from Cortex_M0.
     * |        |          |1= The Cortex_M0 had issued the reset signal to reset the system by software writing 1 to bit SYSRESTREQ(AIRCR[2], Application Interrupt and Reset Control Register) in system control registers of Cortex_M0 kernel.
     * |        |          |This bit is cleared by writing 1 to itself.
     * |[7]     |RSTS_CPU  |Reset by CPU
     * |        |          |The RSTS_CPU Flag Is Set By Hardware If Software Writes CPU_RST (IPRST_CTL1[1]) "1" To Rest Cortex-M0 CPU Kernel And Flash Memory Controller (FMC)
     * |        |          |0= No reset from CPU.
     * |        |          |1= The Cortex-M0 CPU kernel and FMC are reset by software setting CPU_RST to 1.
     * |        |          |This bit is cleared by writing 1 to itself.
    */
    __IO uint32_t RST_SRC;

    /**
     * IPRST_CTL1
     * ===================================================================================================
     * Offset: 0x08  IP Reset Control Resister 1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |CHIP_RST  |CHIP One Shot Reset
     * |        |          |This is a protected register. Please refer to open lock sequence to program it.
     * |        |          |Setting this bit will reset the whole chip, including CPU kernel and all peripherals like power-on reset and this bit will automatically return to "0" after the 2 clock cycles.
     * |        |          |The chip setting from flash will be also reloaded when chip one shot reset.
     * |        |          |0= Normal.
     * |        |          |1= Reset CHIP.
     * |        |          |NOTE: In the following condition, chip setting from flash will be reloaded
     * |        |          |The Power-On Reset
     * |        |          |Brown-Out-Detected Reset
     * |        |          |The low level on the /RESET pin
     * |        |          |Set IPRST_CTL1[CHIP_RST]
     * |[1]     |CPU_RST   |CPU Kernel One Shot Reset
     * |        |          |This is a protected register. Please refer to open lock sequence to program it.
     * |        |          |Setting this bit will only reset the CPU kernel and Flash Memory Controller(FMC), and this bit will automatically return to "0" after the 2 clock cycles
     * |        |          |0= Normal.
     * |        |          |1= Reset CPU.
     * |[2]     |DMA_RST   |DMA Controller Reset
     * |        |          |This is a protected register. Please refer to open lock sequence to program it.
     * |        |          |Set this bit "1" will generate a reset signal to the DMA.
     * |        |          |SW needs to set this bit to low to release reset signal.
     * |        |          |0= Normal operation.
     * |        |          |1= DMA IP reset.
     * |[3]     |EBI_RST   |EBI Controller Reset
     * |        |          |This is a protected register. Please refer to open lock sequence to program it.
     * |        |          |Set this bit "1" will generate a reset signal to the EBI.
     * |        |          |SW needs to set this bit to low to release reset signal.
     * |        |          |0= Normal operation.
     * |        |          |1= EBI IP reset.
    */
    __IO uint32_t IPRST_CTL1;

    /**
     * IPRST_CTL2
     * ===================================================================================================
     * Offset: 0x0C  IP Reset Control Resister 2
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[1]     |GPIO_RST  |GPIO Controller Reset
     * |        |          |0= GPIO normal operation.
     * |        |          |1= GPIO reset.
     * |[2]     |TMR0_RST  |Timer0 Controller Reset
     * |        |          |0= Timer0 normal operation.
     * |        |          |1= Timer0 reset.
     * |[3]     |TMR1_RST  |Timer1 Controller Reset
     * |        |          |0= Timer1 normal operation.
     * |        |          |1= Timer1 block reset.
     * |[4]     |TMR2_RST  |Timer2 Controller Reset
     * |        |          |0= Timer2 normal operation.
     * |        |          |1= Timer2 block reset.
     * |[5]     |TMR3_RST  |Timer3 Controller Reset
     * |        |          |0= Timer3 normal operation.
     * |        |          |1= Timer3 block reset.
     * |[8]     |I2C0_RST  |I2C0 Controller Reset
     * |        |          |0= I2C0 normal operation.
     * |        |          |1= I2C0 block reset.
     * |[9]     |I2C1_RST  |I2C1 Controller Reset
     * |        |          |0= I2C1 block normal operation.
     * |        |          |1= I2C1 block reset.
     * |[12]    |SPI0_RST  |SPI0 Controller Reset
     * |        |          |0= SPI0 block normal operation.
     * |        |          |1= SPI0 block reset.
     * |[13]    |SPI1_RST  |SPI1 Controller Reset
     * |        |          |0= SPI1 normal operation.
     * |        |          |1= SPI1 block reset.
     * |[14]    |SPI2_RST  |SPI2 Controller Reset
     * |        |          |0= SPI2 normal operation.
     * |        |          |1= SPI2 block reset.
     * |[16]    |UART0_RST |UART0 Controller Reset
     * |        |          |0= UART0 normal operation.
     * |        |          |1= UART0 block reset.
     * |[17]    |UART1_RST |UART1 Controller Reset
     * |        |          |0= UART1 normal operation.
     * |        |          |1= UART1 block reset.
     * |[20]    |PWM0_RST  |PWM0 Controller Reset
     * |        |          |0= PWM0 block normal operation.
     * |        |          |1= PWM0 block reset.
     * |[21]    |PWM1_RST  |PWM1 Controller Reset
     * |        |          |0= PWM1 block normal operation.
     * |        |          |1= PWM1 block reset.
     * |[27]    |USBD_RST  |USB Device Controller Reset
     * |        |          |0= USB block normal operation.
     * |        |          |1= USB block reset.
     * |[28]    |ADC_RST   |ADC Controller Reset
     * |        |          |0= ADC block normal operation.
     * |        |          |1= ADC block reset.
     * |[29]    |I2S_RST   |I2S Controller Reset
     * |        |          |0= I2S block normal operation.
     * |        |          |1= I2S block reset.
     * |[30]    |SC0_RST   |SC 0 Controller Reset
     * |        |          |0= SC block normal operation.
     * |        |          |1= SC block reset.
     * |[31]    |SC1_RST   |SC 1 Controller Reset
     * |        |          |0= SC block normal operation.
     * |        |          |1= SC block reset.
    */
    __IO uint32_t IPRST_CTL2;

    /**
     * CPR
     * ===================================================================================================
     * Offset: 0x10  Chip Performance Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |HPE       |High Performance Enable
     * |        |          |This bit is used to control chip operation performance.
     * |        |          |When this bit set, internal RAM and GPIO access is working with zero wait state, Flash controller will predict next address more efficiently
     * |        |          |0 = Chip operation at normal mode.
     * |        |          |1= Chip operation at high performance mode.
    */
    __IO uint32_t CPR;

    /// @cond HIDDEN_SYMBOLS
    uint32_t RESERVE0[3];
    /// @endcond //HIDDEN_SYMBOLS


    /**
     * TEMPCTL
     * ===================================================================================================
     * Offset: 0x20  Temperature Sensor Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |VTEMP_EN  |Temperature Sensor Enable
     * |        |          |0 = Temperature sensor function Disabled (default).
     * |        |          |1 = Temperature sensor function Enabled.
    */
    __IO uint32_t TEMPCTL;

    /// @cond HIDDEN_SYMBOLS
    uint32_t RESERVE1[3];
    /// @endcond //HIDDEN_SYMBOLS


    /**
     * PA_L_MFP
     * ===================================================================================================
     * Offset: 0x30  Port A low byte multiple function control register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[2:0]   |PA0_MFP   |PA.0 Pin Function Selection
     * |        |          |001 = ADC input channel 0
     * |        |          |Others = GPIOA[0]
     * |[6:4]   |PA1_MFP   |PA.1 Pin Function Selection
     * |        |          |001 = ADC input channel 1
     * |        |          |010 = EBI AD[12]
     * |        |          |Others = GPIOA[1]
     * |[10:8]  |PA2_MFP   |PA.2 Pin Function Selection
     * |        |          |001 = ADC input channel 2
     * |        |          |010 = EBI AD[11]
     * |        |          |101 = UART1_RXD
     * |        |          |Others = GPIOA[2]
     * |[14:12] |PA3_MFP   |PA.3 Pin Function Selection
     * |        |          |001 = ADC input channel 3
     * |        |          |010 = EBI AD[10]
     * |        |          |101 = UART1_TXD
     * |        |          |Others = GPIOA[3]
     * |[18:16] |PA4_MFP   |PA.4 Pin Function Selection
     * |        |          |001 = ADC input channel 4
     * |        |          |010 = EBI AD[9]
     * |        |          |101 = I2C0 SDA
     * |        |          |Others = GPIOA[4]
     * |[22:20] |PA5_MFP   |PA.5 Pin Function Selection
     * |        |          |001 = ADC input channel 5
     * |        |          |010 = EBI AD[8]
     * |        |          |101 = I2C0 SCL
     * |        |          |Others = GPIOA[5]
     * |[26:24] |PA6_MFP   |PA.6 Pin Function Selection
     * |        |          |001 = ADC input channel 6
     * |        |          |010 = EBI AD[7]
     * |        |          |011 = Timer 3 Capture event
     * |        |          |101 = PWM0 Channel 3
     * |        |          |Others = GPIOA[6]
     * |[30:28] |PA7_MFP   |PA.7 Pin Function Selection
     * |        |          |001 = ADC input channel 7
     * |        |          |010 = EBI AD[6]
     * |        |          |011 = Timer 2 capture event
     * |        |          |101 = PWM0 Channel 2
     * |        |          |Others = GPIOA[7]
    */
    __IO uint32_t PA_L_MFP;

    /**
     * PA_H_MFP
     * ===================================================================================================
     * Offset: 0x34  Port A high byte multiple function control register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[2:0]   |PA8_MFP   |PA.8 Pin Function Selection
     * |        |          |001 = I2C0 SDA
     * |        |          |011 = SmartCard0 clock
     * |        |          |100 = SPI2 1st slave select pin
     * |        |          |Others = GPIOA[8]
     * |[6:4]   |PA9_MFP   |PA.9 Pin Function Selection
     * |        |          |001 = I2C0 SCL
     * |        |          |011 = SmartCard0 DATA
     * |        |          |100 = SPI2 SCLK
     * |        |          |Others = GPIOA[9]
     * |[10:8]  |PA10_MFP  |PA.10 Pin Function Selection
     * |        |          |001 = I2C1 SDA
     * |        |          |010 = EBI nWR
     * |        |          |011 = SmartCard0 Power
     * |        |          |100 = SPI2 MISO0
     * |        |          |Others = GPIOA[10]
     * |[14:12] |PA11_MFP  |PA.11 Pin Function Selection
     * |        |          |001 = I2C1 SCL
     * |        |          |010 = EBI nRE
     * |        |          |011 = SmartCard0 RST
     * |        |          |100 = SPI2 MOSI0
     * |        |          |Others = GPIOA[11]
     * |[18:16] |PA12_MFP  |PA.12 Pin Function Selection
     * |        |          |001 = PWM0 Channel 0
     * |        |          |010 = EBI AD[13]
     * |        |          |011 = Timer0 capture event
     * |        |          |101 = I2C0 SDA
     * |        |          |Others = GPIOA[12]
     * |[22:20] |PA13_MFP  |PA.13 Pin Function Selection
     * |        |          |001 = PWM0 Channel 1
     * |        |          |010 = EBI AD[14]
     * |        |          |011 = Timer1 capture event
     * |        |          |101 = I2C0 SCL
     * |        |          |Others = GPIOA[13]
     * |[26:24] |PA14_MFP  |PA.14 Pin Function Selection
     * |        |          |001 = PWM0 Channel 2
     * |        |          |010 = EBI AD[15]
     * |        |          |011 = Timer2 capture event
     * |        |          |110 = UART0 RX
     * |        |          |Others = GPIOA[14]
     * |[30:28] |PA15_MFP  |PA.15 Pin Function Selection
     * |        |          |001 = PWM0 Channel 3
     * |        |          |010 = I2S MCLK
     * |        |          |011 = Timer3 capture event
     * |        |          |110 = UART0 TX
     * |        |          |Others = GPIOA[15]
    */
    __IO uint32_t PA_H_MFP;

    /**
     * PB_L_MFP
     * ===================================================================================================
     * Offset: 0x38  Port B low byte multiple function control register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[2:0]   |PB0_MFP   |PB.0 Pin Function Selection
     * |        |          |001 = UART0 RX
     * |        |          |011 = SPI1 MOSI0
     * |        |          |Others = GPIOB[0]
     * |[6:4]   |PB1_MFP   |PB.1 Pin Function Selection
     * |        |          |001 = UART0 TX
     * |        |          |011 = SPI1 MISO0
     * |        |          |Others = GPIOB[1]
     * |[10:8]  |PB2_MFP   |PB.2 Pin Function Selection
     * |        |          |001 = UART0 RTSn
     * |        |          |010 = EBI nWRL
     * |        |          |011 = SPI1 SCLK
     * |        |          |Others = GPIOB[2]
     * |[14:12] |PB3_MFP   |PB.3 Pin Function Selection
     * |        |          |001 = UART0 CTSn
     * |        |          |010 = EBI nWRH
     * |        |          |011 = SPI1 1st slave select pin
     * |        |          |Others = GPIOB[3]
     * |[18:16] |PB4_MFP   |PB.4 Pin Function Selection
     * |        |          |001 = UART1 RX
     * |        |          |011 = SmartCard0 card detection
     * |        |          |100 = SPI2 1st slave select pin
     * |        |          |Others = GPIOB[4]
     * |[22:20] |PB5_MFP   |PB.5 Pin Function Selection
     * |        |          |001 = UART1 TX
     * |        |          |100 = SPI2 SCLK
     * |        |          |Others = GPIOB[5]
     * |[26:24] |PB6_MFP   |PB.6 Pin Function Selection
     * |        |          |001 = UART1 RTSn
     * |        |          |010 = EBI ALE
     * |        |          |100 = SPI2 MISO0
     * |        |          |Others = GPIOB[6]
     * |[30:28] |PB7_MFP   |PB.7 Pin Function Selection
     * |        |          |001 = UART1 CTSn
     * |        |          |010 = EBI nCS
     * |        |          |100 = SPI2 MOSI0
     * |        |          |Others = GPIOB[7]
    */
    __IO uint32_t PB_L_MFP;

